public/arguments.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Script Arguments</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" >

</head>
<body>
<div id="content" class="content">
<h1 class="title">Script Arguments</h1>
<div id="table-of-contents" role="doc-toc">
<h2 onclick="toggleTOC()">Table of Contents<span class="toggle-icon">▼</span></h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c48d9c">Getting arguments</a></li>
<li><a href="#org7be9900">Processing arguments</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2c48d9c" class="outline-2">
<h2 id="org2c48d9c">Getting arguments</h2>
<div class="outline-text-2" id="text-org2c48d9c">
<p>
We can access the arguments passed to our script with the following:
</p>

<ul class="org-ul">
<li><code>$#</code> gives us the number of arguments</li>
<li><code>$1</code>, &#x2026;, <code>$9</code> gives us each argument</li>
<li><code>$*</code> gives us all of the arguments</li>
<li>other</li>
</ul>

<p>
<code>scripts/show-args.sh</code>:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;"> -
</span>
<span style="font-weight: bold;">arg_count</span>() {
    <span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'argument count:'</span> $<span style="font-weight: bold; font-style: italic;">#</span>
}

printf <span style="font-style: italic;">'Number of arguments: %d\n\n'</span> $<span style="font-weight: bold; font-style: italic;">#</span>

printf <span style="font-style: italic;">'First arg is: %s\n\n'</span> $<span style="font-weight: bold; font-style: italic;">1</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">without double quotes, these are essencially the same
</span><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">these dont preserve whitespace
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'All args: '</span> $<span style="font-weight: bold; font-style: italic;">*</span>
arg_count $<span style="font-weight: bold; font-style: italic;">*</span>
<span style="font-weight: bold;">echo</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'All args: '</span> $<span style="font-weight: bold; font-style: italic;">@</span>
arg_count $<span style="font-weight: bold; font-style: italic;">@</span>
<span style="font-weight: bold;">echo</span>

<span style="font-weight: bold;">echo</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">gives us all args AS A SINGLE ARG
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'All args, double quoted:  '</span> <span style="font-style: italic;">"$*"</span>
arg_count <span style="font-style: italic;">"$*"</span>
<span style="font-weight: bold;">echo</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">gives us all args as separate individual
</span><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">double quoted strings (preserves whitespace)
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'All args, double quoted:  '</span> <span style="font-style: italic;">"$@"</span>
arg_count <span style="font-style: italic;">"$@"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">./scripts/show-args.sh a b c d <span style="font-style: italic;">'1 2 3'</span> e f
</pre>
</div>

<pre class="example" id="org0df4b3d">
Number of arguments: 7

First arg is: a

All args:  a b c d 1 2 3 e f
argument count: 9

All args:  a b c d 1 2 3 e f
argument count: 9


All args, double quoted:   a b c d 1 2 3 e f
argument count: 1

All args, double quoted:   a b c d 1 2 3 e f
argument count: 7
</pre>

<p>
<b>Always use <code>"$@"</code> to refer to all the command line args</b>
</p>

<p>
<b>OBS</b>: In the command line, we dont have any args!
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">#</span>
</pre>
</div>

<pre class="example">
0
</pre>
</div>
</div>
<div id="outline-container-org7be9900" class="outline-2">
<h2 id="org7be9900">Processing arguments</h2>
<div class="outline-text-2" id="text-org7be9900">
<p>
There are 2 ways:
</p>

<ul class="org-ul">
<li>using a <code>while</code> loop: (<code>scripts/process-args-while.sh</code>)</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;"> -
</span>
<span style="font-weight: bold;">echo</span> Processing $<span style="font-weight: bold; font-style: italic;">#</span> arguments

<span style="font-weight: bold; font-style: italic;">count</span>=1
<span style="font-weight: bold;">while</span> [ $<span style="font-weight: bold; font-style: italic;">#</span> -gt 0 ]; <span style="font-weight: bold;">do</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">in a real scripts, do something with "$1"
</span>    printf <span style="font-style: italic;">"  Argument %d: '%s'\n"</span> <span style="font-style: italic;">"$count"</span> <span style="font-style: italic;">"$1"</span>

    <span style="font-weight: bold;">let</span> <span style="font-style: italic;">"count = count + 1"</span>

    <span style="font-weight: bold;">shift</span> <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">shifts the arguments of the end
</span><span style="font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">./scripts/process-args-while.sh a b c d <span style="font-style: italic;">'1 2 3'</span> e f
</pre>
</div>

<pre class="example">
Processing 7 arguments
  Argument 1: 'a'
  Argument 2: 'b'
  Argument 3: 'c'
  Argument 4: 'd'
  Argument 5: '1 2 3'
  Argument 6: 'e'
  Argument 7: 'f'
</pre>


<ul class="org-ul">
<li>a <code>for</code> loop, <b>most common</b>: (<code>scripts/process-args-for.sh</code>)</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;"> -
</span>
<span style="font-weight: bold;">echo</span> Processing $<span style="font-weight: bold; font-style: italic;">#</span> arguments

<span style="font-weight: bold; font-style: italic;">count</span>=1
<span style="font-weight: bold;">for</span> i; <span style="font-weight: bold;">do</span> <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">default is for i in "$@"
</span>    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">in a real scripts, do something with "$1"
</span>    printf <span style="font-style: italic;">"  Argument %d: '%s'\n"</span> <span style="font-style: italic;">"$count"</span> <span style="font-style: italic;">"$1"</span>

    <span style="font-weight: bold;">let</span> <span style="font-style: italic;">"count = count + 1"</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">./scripts/process-args-for.sh a b c d <span style="font-style: italic;">'1 2 3'</span> e f
</pre>
</div>

<pre class="example">
Processing 7 arguments
  Argument 1: 'a'
  Argument 2: 'b'
  Argument 3: 'c'
  Argument 4: 'd'
  Argument 5: '1 2 3'
  Argument 6: 'e'
  Argument 7: 'f'
</pre>
</div>
</div>
</div>
</body>
</html>
